In [1]:
pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in e:\anaconda\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in e:\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in e:\anaconda\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [4]:
lst=[101,'Prathyusha',77.43]
sc=pd.Series(lst)
print(sc)

0           101
1    Prathyusha
2         77.43
dtype: object

In [6]:
lst1=[102,'Arjun',88.45,True]
sc1=pd.Series(lst1)
print(sc1)

0      102
1    Arjun
2    88.45
3     True
dtype: object

In [7]:
lst1=(102,'Arjun',88.45,True)
sc1=pd.Series(lst1)
print(sc1)

0      102
1    Arjun
2    88.45
3     True
dtype: object

In [8]:
l=["Arjun","Suryakumer","Karan",100]
sa2=pd.Series(l)
print(sa2)

0         Arjun
1    Suryakumer
2         Karan
3           100
dtype: object

In [11]:
l1=[1.2,3.4,6.7,'d']
sc3=pd.Series(l1)
print(sc3)

0    1.2
1    3.4
2    6.7
3      d
dtype: object

In [14]:
dic={101:"Prathyusha",102:"Arjun",103:"Karan",104:"Shadick"}
scd=pd.Series(dic)
print(scd)

101    Prathyusha
102         Arjun
103         Karan
104       Shadick
dtype: object

In [20]:
l2=[10,20,30,40,50,70,80,90,100,110]
ind=['p','r','a','t','h','y','u','s','h','a']
scind=pd.Series(l2,index=ind)
print(scind)

p     10
r     20
a     30
t     40
h     50
y     70
u     80
s     90
h    100
a    110
dtype: int64

In [2]:
l4=[10,20,40,40]
se=pd.Series(l4,index=['x','y','z','a'])
se

x    10
y    20
z    40
a    40
dtype: int64

In [4]:
dict={101:"Prathyusha",102:"Arjun",103:"Karan"}
se=pd.Series(dict,index=["a","s",103])
se

a        NaN
s        NaN
103    Karan
dtype: object

In [23]:
l3[0]

101

In [24]:
l3[3][0]

'Hindi'

In [32]:
dic1={101:"Prathyusha",102:"Arjun",103:"Karan",104:"Shadick",104:"Suryakanth"}
print(dic1)
dic_ind={"A","R","J","U","n"}
sc_dic_ind=pd.Series(dic1,index=dic_ind)
print(sc_dic_ind)

{101: 'Prathyusha', 102: 'Arjun', 103: 'Karan', 104: 'Suryakanth'}
J    NaN
R    NaN
n    NaN
A    NaN
U    NaN
dtype: object

In [33]:
dic2={101:"Prathyusha",102:"Arjun",103:"Karan",104:"Shadick",104:"Suryakanth"}

In [34]:
a="PRATHYUSHA KETHIREDDY"
a[::-1]

'YDDERIHTEK AHSUYHTARP'

In [37]:
b=12345
c=str(b)
print(c)
c[::-1]

12345

'54321'

In [46]:
li=[1,2,3,4,5,6,7,8,9,10]
oi=[]
ei=[]
for i in li:
    if i%2==0:
        ei.append(i)
    else:
        oi.append(i)
print("List of OOD Numbers : ",oi)
print("List Of EVEN Number : ",ei)

List of OOD Numbers :  [1, 3, 5, 7, 9]
List Of EVEN Number :  [2, 4, 6, 8, 10]

In [45]:
b = [4.6,8,'a']
bse = pd.Series(b)
intli =[]
strli = []
floli = []
for i in bse:
    if type(i) == int:
        intli.append(i)
    elif type(i) == str:
        strli.append(i)
    elif type(i) == float:
        floli.append(i)
        
print(intli)
print(strli)
print(floli)

[8]
['a']
[4.6]

In [3]:
dict={1:"Prathyusha",2:"Arjun",3:"Karan"}
sc_dict=pd.Series(dict)
print(sc_dict)

1    Prathyusha
2         Arjun
3         Karan
dtype: object

In [10]:
dict={1:"Prathyusha",2:"Arjun",3:"Karan"}
se_dict=pd.Series(dict)
sedf=pd.DataFrame(se_dict)
print(sedf)

            0
1  Prathyusha
2       Arjun
3       Karan

In [8]:
dict1={"Name":["Prathyusha","Arjun","Karan"],"Age":[25,34,36]}
se_dict=pd.Series(dict1)
sedf=pd.DataFrame(sedf)
print(sedf)

         Name  Age
0  Prathyusha   25
1       Arjun   34
2       Karan   36

In [13]:
dict2={"Places":["TajMahal","Beches"],"States":("Delhi","Goa")}
sedf=pd.DataFrame(dict2)
print(sedf)

     Places States
0  TajMahal  Delhi
1    Beches    Goa

In [20]:
dict2={"Places":["TajMahal","Beches","Golconda"],"States":["Delhi","Goa"]}
se=pd.Series(dict2)
print(se)
sedf=pd.DataFrame(se)
print(sedf)

Places    [TajMahal, Beches, Golconda]
States                    [Delhi, Goa]
dtype: object
                                   0
Places  [TajMahal, Beches, Golconda]
States                  [Delhi, Goa]

In [21]:
dict3={"Countrys":{1:"India",2:"US"}}
sedf=pd.DataFrame(dict3)
print(sedf)

  Countrys
1    India
2       US

In [28]:
dict4={("Name","Age"):("Arjun",35)}
print(dict4)
sedf=pd.DataFrame(dict4)
print(sedf)

{('Name', 'Age'): ('Arjun', 35)}
    Name
     Age
0  Arjun
1     35

In [34]:
a=pd.read_csv("markes.csv")
a

         Name  Age  Markes
0  Prathyusha   25      99
1       Arjun   34      98
2       Karan   36      56

In [52]:
import pandas as pd
import numpy as np
dict1={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
scdf=pd.DataFrame(dict1,index=labels)
scdf

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [51]:
## 3.Write a Pandas program to get the first 3 rows of a given DataFrame
df1=scdf.head(3)
df1

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [50]:
## 4.Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2
row=(scdf[scdf['attempts']>2])
row

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [41]:
## Write a Pandas program to count the number of rows and columns of a DataFrame
total_rows=len(scdf.axes[0])
total_cols=len(scdf.axes[1])
print("Number of Rows: ",(total_rows))
print("Number of Columns: ",(total_cols))

Number of Rows:  10
Number of Columns:  4

In [49]:
## Write a Pandas program to select the rows where the score is missing, i.e. is NaN.
sc_miss=(scdf[scdf['score'].isnull()])
sc_miss

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [53]:
## Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
info=scdf.info()
info

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [16]:
import pandas as pd
import numpy as np
dict1={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
scdf=pd.DataFrame(dict1,index=labels)
print(scdf.loc['g'])

name        Matthew
score          14.5
attempts          1
qualify         yes
Name: g, dtype: object

In [32]:
d={"name":["X","y","z","a","b","c","d"],"Age":[1,2,3,4,5,6,7]}
scdf=pd.DataFrame(d)
scdf
print(scdf.loc[3])
print(scdf.loc[2])
print(scdf.loc[[1, 4]])
print(scdf.add_prefix('emp_'))

name    a
Age     4
Name: 3, dtype: object
name    z
Age     3
Name: 2, dtype: object
  name  Age
1    y    2
4    b    5
  emp_name  emp_Age
0        X        1
1        y        2
2        z        3
3        a        4
4        b        5
5        c        6
6        d        7

In [43]:
l1=[[12,10,20,30],[34,5,67,45]]
scdf=pd.DataFrame(l1)
print(scdf.abs())
print(scdf.add(20))
print(scdf.agg(["sum"]))

    0   1   2   3
0  12  10  20  30
1  34   5  67  45
    0   1   2   3
0  32  30  40  50
1  54  25  87  65
      0   1   2   3
sum  46  15  87  75